NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    side
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
